avrdudes/avr-libc/include/avr/ioavr32la28.h
/*
 * Header file for AVR32LA28
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioavr32la28.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_AVR32LA28_H_INCLUDED
#define _AVR_AVR32LA28_H_INCLUDED

/* Ungrouped common registers */
#define CCP  _SFR_MEM8(0x0034)  /* Configuration Change Protection */
#define SP  _SFR_MEM16(0x003D)  /* Stack Pointer */
#define SPL  _SFR_MEM8(0x003D)  /* Stack Pointer Low */
#define SPH  _SFR_MEM8(0x003E)  /* Stack Pointer High */
#define SREG  _SFR_MEM8(0x003F)  /* Status Register */

/* C Language Only */
#if !defined (__ASSEMBLER__)

#include <stdint.h>

typedef volatile uint8_t register8_t;
typedef volatile uint16_t register16_t;
typedef volatile uint32_t register32_t;

#ifdef _WORDREGISTER
#undef _WORDREGISTER
#endif
#define _WORDREGISTER(regname)        \
    __extension__ union               \
    {                                 \
        register16_t (regname);       \
        struct                        \
        {                             \
            register8_t regname ## L; \
            register8_t regname ## H; \
        };                            \
    }

#ifdef _DWORDREGISTER
#undef _DWORDREGISTER
#endif
#define _DWORDREGISTER(regname)       \
    __extension__ union               \
    {                                 \
        register32_t (regname);       \
        struct                        \
        {                             \
            register8_t regname ## 0; \
            register8_t regname ## 1; \
            register8_t regname ## 2; \
            register8_t regname ## 3; \
        };                            \
    }




#endif /* !defined (__ASSEMBLER__) */


/*================== Bitfield Definitions ================== */

/* AC - Analog Comparator */
/* AC.CTRLA  bit masks and bit positions */
#define AC_ENABLE_bm  0x01  /* Enable AC bit mask. */
#define AC_ENABLE_bp  0  /* Enable AC bit position. */
#define AC_HYSMODE_gm  0x06  /* Hysteresis Mode Select group mask. */
#define AC_HYSMODE_gp  1  /* Hysteresis Mode Select group position. */
#define AC_HYSMODE_0_bm  (1<<1)  /* Hysteresis Mode Select bit 0 mask. */
#define AC_HYSMODE_0_bp  1  /* Hysteresis Mode Select bit 0 position. */
#define AC_HYSMODE_1_bm  (1<<2)  /* Hysteresis Mode Select bit 1 mask. */
#define AC_HYSMODE_1_bp  2  /* Hysteresis Mode Select bit 1 position. */
#define AC_OPSEL_gm  0x60  /* Operation Select group mask. */
#define AC_OPSEL_gp  5  /* Operation Select group position. */
#define AC_OPSEL_0_bm  (1<<5)  /* Operation Select bit 0 mask. */
#define AC_OPSEL_0_bp  5  /* Operation Select bit 0 position. */
#define AC_OPSEL_1_bm  (1<<6)  /* Operation Select bit 1 mask. */
#define AC_OPSEL_1_bp  6  /* Operation Select bit 1 position. */
#define AC_RUNSTDBY_bm  0x80  /* Run in Standby Mode bit mask. */
#define AC_RUNSTDBY_bp  7  /* Run in Standby Mode bit position. */

/* AC.CTRLB  bit masks and bit positions */
#define AC_INITVAL_bm  0x08  /* Output initial value bit mask. */
#define AC_INITVAL_bp  3  /* Output initial value bit position. */
#define AC_INVERT_bm  0x10  /* Invert AC Output bit mask. */
#define AC_INVERT_bp  4  /* Invert AC Output bit position. */
#define AC_OUTEN_bm  0x20  /* Output Enable bit mask. */
#define AC_OUTEN_bp  5  /* Output Enable bit position. */

/* AC.MUXCTRL  bit masks and bit positions */
#define AC_MUXNEG_gm  0x07  /* Negative Input MUX Selection group mask. */
#define AC_MUXNEG_gp  0  /* Negative Input MUX Selection group position. */
#define AC_MUXNEG_0_bm  (1<<0)  /* Negative Input MUX Selection bit 0 mask. */
#define AC_MUXNEG_0_bp  0  /* Negative Input MUX Selection bit 0 position. */
#define AC_MUXNEG_1_bm  (1<<1)  /* Negative Input MUX Selection bit 1 mask. */
#define AC_MUXNEG_1_bp  1  /* Negative Input MUX Selection bit 1 position. */
#define AC_MUXNEG_2_bm  (1<<2)  /* Negative Input MUX Selection bit 2 mask. */
#define AC_MUXNEG_2_bp  2  /* Negative Input MUX Selection bit 2 position. */
#define AC_MUXPOS_gm  0x38  /* Positive Input MUX Selection group mask. */
#define AC_MUXPOS_gp  3  /* Positive Input MUX Selection group position. */
#define AC_MUXPOS_0_bm  (1<<3)  /* Positive Input MUX Selection bit 0 mask. */
#define AC_MUXPOS_0_bp  3  /* Positive Input MUX Selection bit 0 position. */
#define AC_MUXPOS_1_bm  (1<<4)  /* Positive Input MUX Selection bit 1 mask. */
#define AC_MUXPOS_1_bp  4  /* Positive Input MUX Selection bit 1 position. */
#define AC_MUXPOS_2_bm  (1<<5)  /* Positive Input MUX Selection bit 2 mask. */
#define AC_MUXPOS_2_bp  5  /* Positive Input MUX Selection bit 2 position. */

/* AC.REFSCALE  bit masks and bit positions */
#define AC_REFSCALE_gm  0xFF  /* Scaled Reference Voltage group mask. */
#define AC_REFSCALE_gp  0  /* Scaled Reference Voltage group position. */
#define AC_REFSCALE_0_bm  (1<<0)  /* Scaled Reference Voltage bit 0 mask. */
#define AC_REFSCALE_0_bp  0  /* Scaled Reference Voltage bit 0 position. */
#define AC_REFSCALE_1_bm  (1<<1)  /* Scaled Reference Voltage bit 1 mask. */
#define AC_REFSCALE_1_bp  1  /* Scaled Reference Voltage bit 1 position. */
#define AC_REFSCALE_2_bm  (1<<2)  /* Scaled Reference Voltage bit 2 mask. */
#define AC_REFSCALE_2_bp  2  /* Scaled Reference Voltage bit 2 position. */
#define AC_REFSCALE_3_bm  (1<<3)  /* Scaled Reference Voltage bit 3 mask. */
#define AC_REFSCALE_3_bp  3  /* Scaled Reference Voltage bit 3 position. */
#define AC_REFSCALE_4_bm  (1<<4)  /* Scaled Reference Voltage bit 4 mask. */
#define AC_REFSCALE_4_bp  4  /* Scaled Reference Voltage bit 4 position. */
#define AC_REFSCALE_5_bm  (1<<5)  /* Scaled Reference Voltage bit 5 mask. */
#define AC_REFSCALE_5_bp  5  /* Scaled Reference Voltage bit 5 position. */
#define AC_REFSCALE_6_bm  (1<<6)  /* Scaled Reference Voltage bit 6 mask. */
#define AC_REFSCALE_6_bp  6  /* Scaled Reference Voltage bit 6 position. */
#define AC_REFSCALE_7_bm  (1<<7)  /* Scaled Reference Voltage bit 7 mask. */
#define AC_REFSCALE_7_bp  7  /* Scaled Reference Voltage bit 7 position. */

/* AC.INTCTRL  bit masks and bit positions */
#define AC_CMP_bm  0x01  /* Comparator Interrupt Enable bit mask. */
#define AC_CMP_bp  0  /* Comparator Interrupt Enable bit position. */
#define AC_INTMODE_gm  0x30  /* Interrupt Mode group mask. */
#define AC_INTMODE_gp  4  /* Interrupt Mode group position. */
#define AC_INTMODE_0_bm  (1<<4)  /* Interrupt Mode bit 0 mask. */
#define AC_INTMODE_0_bp  4  /* Interrupt Mode bit 0 position. */
#define AC_INTMODE_1_bm  (1<<5)  /* Interrupt Mode bit 1 mask. */
#define AC_INTMODE_1_bp  5  /* Interrupt Mode bit 1 position. */

/* AC.INTFLAGS  bit masks and bit positions */
/* AC_CMP  is already defined. */

/* AC.STATUS  bit masks and bit positions */
/* AC_CMP  is already defined. */


/* ADC - Analog to Digital Converter */
/* ADC.CTRLA  bit masks and bit positions */
#define ADC_ENABLE_bm  0x01  /* ADC Enable bit mask. */
#define ADC_ENABLE_bp  0  /* ADC Enable bit position. */
#define ADC_LOWLAT_bm  0x20  /* Low Latency bit mask. */
#define ADC_LOWLAT_bp  5  /* Low Latency bit position. */
#define ADC_RUNSTDBY_bm  0x80  /* Run in Standby Mode bit mask. */
#define ADC_RUNSTDBY_bp  7  /* Run in Standby Mode bit position. */

/* ADC.CTRLB  bit masks and bit positions */
#define ADC_PRESC_gm  0x1F  /* ADC Prescaler group mask. */
#define ADC_PRESC_gp  0  /* ADC Prescaler group position. */
#define ADC_PRESC_0_bm  (1<<0)  /* ADC Prescaler bit 0 mask. */
#define ADC_PRESC_0_bp  0  /* ADC Prescaler bit 0 position. */
#define ADC_PRESC_1_bm  (1<<1)  /* ADC Prescaler bit 1 mask. */
#define ADC_PRESC_1_bp  1  /* ADC Prescaler bit 1 position. */
#define ADC_PRESC_2_bm  (1<<2)  /* ADC Prescaler bit 2 mask. */
#define ADC_PRESC_2_bp  2  /* ADC Prescaler bit 2 position. */
#define ADC_PRESC_3_bm  (1<<3)  /* ADC Prescaler bit 3 mask. */
#define ADC_PRESC_3_bp  3  /* ADC Prescaler bit 3 position. */
#define ADC_PRESC_4_bm  (1<<4)  /* ADC Prescaler bit 4 mask. */
#define ADC_PRESC_4_bp  4  /* ADC Prescaler bit 4 position. */

/* ADC.CTRLC  bit masks and bit positions */
#define ADC_REFSEL_gm  0x07  /* Reference Selection group mask. */
#define ADC_REFSEL_gp  0  /* Reference Selection group position. */
#define ADC_REFSEL_0_bm  (1<<0)  /* Reference Selection bit 0 mask. */
#define ADC_REFSEL_0_bp  0  /* Reference Selection bit 0 position. */
#define ADC_REFSEL_1_bm  (1<<1)  /* Reference Selection bit 1 mask. */
#define ADC_REFSEL_1_bp  1  /* Reference Selection bit 1 position. */
#define ADC_REFSEL_2_bm  (1<<2)  /* Reference Selection bit 2 mask. */
#define ADC_REFSEL_2_bp  2  /* Reference Selection bit 2 position. */

/* ADC.CTRLD  bit masks and bit positions */
#define ADC_WINCM_gm  0x07  /* Window Comparator Mode group mask. */
#define ADC_WINCM_gp  0  /* Window Comparator Mode group position. */
#define ADC_WINCM_0_bm  (1<<0)  /* Window Comparator Mode bit 0 mask. */
#define ADC_WINCM_0_bp  0  /* Window Comparator Mode bit 0 position. */
#define ADC_WINCM_1_bm  (1<<1)  /* Window Comparator Mode bit 1 mask. */
#define ADC_WINCM_1_bp  1  /* Window Comparator Mode bit 1 position. */
#define ADC_WINCM_2_bm  (1<<2)  /* Window Comparator Mode bit 2 mask. */
#define ADC_WINCM_2_bp  2  /* Window Comparator Mode bit 2 position. */
#define ADC_WINSRC_bm  0x08  /* Window Mode Source bit mask. */
#define ADC_WINSRC_bp  3  /* Window Mode Source bit position. */

