avrdudes/avr-libc/include/avr/ioavr32la28.h
/* Positive Input Multiplexer select bit group configurations*/
typedef enum ADC_MUXPOS_enum
{
    ADC_MUXPOS_AIN0_gc             = (ADC_MUXPOS_AIN0_gv << ADC_MUXPOS_gp),  /* ADC input pin 0 */
    ADC_MUXPOS_AIN1_gc             = (ADC_MUXPOS_AIN1_gv << ADC_MUXPOS_gp),  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gc             = (ADC_MUXPOS_AIN2_gv << ADC_MUXPOS_gp),  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gc             = (ADC_MUXPOS_AIN3_gv << ADC_MUXPOS_gp),  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gc             = (ADC_MUXPOS_AIN4_gv << ADC_MUXPOS_gp),  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gc             = (ADC_MUXPOS_AIN5_gv << ADC_MUXPOS_gp),  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gc             = (ADC_MUXPOS_AIN6_gv << ADC_MUXPOS_gp),  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gc             = (ADC_MUXPOS_AIN7_gv << ADC_MUXPOS_gp),  /* ADC input pin 7 */
    ADC_MUXPOS_AIN16_gc            = (ADC_MUXPOS_AIN16_gv << ADC_MUXPOS_gp),  /* ADC input pin 16 */
    ADC_MUXPOS_AIN17_gc            = (ADC_MUXPOS_AIN17_gv << ADC_MUXPOS_gp),  /* ADC input pin 17 */
    ADC_MUXPOS_AIN22_gc            = (ADC_MUXPOS_AIN22_gv << ADC_MUXPOS_gp),  /* ADC input pin 22 */
    ADC_MUXPOS_AIN23_gc            = (ADC_MUXPOS_AIN23_gv << ADC_MUXPOS_gp),  /* ADC input pin 23 */
    ADC_MUXPOS_AIN24_gc            = (ADC_MUXPOS_AIN24_gv << ADC_MUXPOS_gp),  /* ADC input pin 24 */
    ADC_MUXPOS_AIN25_gc            = (ADC_MUXPOS_AIN25_gv << ADC_MUXPOS_gp),  /* ADC input pin 25 */
    ADC_MUXPOS_AIN26_gc            = (ADC_MUXPOS_AIN26_gv << ADC_MUXPOS_gp),  /* ADC input pin 26 */
    ADC_MUXPOS_AIN27_gc            = (ADC_MUXPOS_AIN27_gv << ADC_MUXPOS_gp),  /* ADC input pin 27 */
    ADC_MUXPOS_TEMPSENSE_gc        = (ADC_MUXPOS_TEMPSENSE_gv << ADC_MUXPOS_gp),  /* Temperature Sensor */
    ADC_MUXPOS_VDDDIV10_gc         = (ADC_MUXPOS_VDDDIV10_gv << ADC_MUXPOS_gp),  /* VDD Divided by 10 */
    ADC_MUXPOS_AC0REFSCALE_gc      = (ADC_MUXPOS_AC0REFSCALE_gv << ADC_MUXPOS_gp),  /* AC0 Reference Scaler */
    ADC_MUXPOS_PTC_gc              = (ADC_MUXPOS_PTC_gv << ADC_MUXPOS_gp)   /* Peripheral Touch Controller */
} ADC_MUXPOS_t;

/* ADC Prescaler select bit group values */
typedef enum ADC_PRESC_VALUES_enum
{
    ADC_PRESC_DIV2_gv              = 0x00,  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV3_gv              = 0x01,  /* CLK_PER divided by 3 */
    ADC_PRESC_DIV4_gv              = 0x02,  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV5_gv              = 0x03,  /* CLK_PER divided by 5 */
    ADC_PRESC_DIV6_gv              = 0x04,  /* CLK_PER divided by 6 */
    ADC_PRESC_DIV7_gv              = 0x05,  /* CLK_PER divided by 7 */
    ADC_PRESC_DIV8_gv              = 0x06,  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV9_gv              = 0x07,  /* CLK_PER divided by 9 */
    ADC_PRESC_DIV10_gv             = 0x08,  /* CLK_PER divided by 10 */
    ADC_PRESC_DIV11_gv             = 0x09,  /* CLK_PER divided by 11 */
    ADC_PRESC_DIV12_gv             = 0x0A,  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV13_gv             = 0x0B,  /* CLK_PER divided by 13 */
    ADC_PRESC_DIV14_gv             = 0x0C,  /* CLK_PER divided by 14 */
    ADC_PRESC_DIV15_gv             = 0x0D,  /* CLK_PER divided by 15 */
    ADC_PRESC_DIV16_gv             = 0x0E,  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV17_gv             = 0x0F,  /* CLK_PER divided by 17 */
    ADC_PRESC_DIV18_gv             = 0x10,  /* CLK_PER divided by 18 */
    ADC_PRESC_DIV19_gv             = 0x11,  /* CLK_PER divided by 19 */
    ADC_PRESC_DIV20_gv             = 0x12,  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV21_gv             = 0x13,  /* CLK_PER divided by 21 */
    ADC_PRESC_DIV22_gv             = 0x14,  /* CLK_PER divided by 22 */
    ADC_PRESC_DIV23_gv             = 0x15,  /* CLK_PER divided by 23 */
    ADC_PRESC_DIV24_gv             = 0x16,  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV25_gv             = 0x17,  /* CLK_PER divided by 25 */
    ADC_PRESC_DIV26_gv             = 0x18,  /* CLK_PER divided by 26 */
    ADC_PRESC_DIV27_gv             = 0x19,  /* CLK_PER divided by 27 */
    ADC_PRESC_DIV28_gv             = 0x1A,  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV29_gv             = 0x1B,  /* CLK_PER divided by 29 */
    ADC_PRESC_DIV30_gv             = 0x1C,  /* CLK_PER divided by 30 */
    ADC_PRESC_DIV31_gv             = 0x1D,  /* CLK_PER divided by 31 */
    ADC_PRESC_DIV32_gv             = 0x1E   /* CLK_PER divided by 32 */
} ADC_PRESC_values_t;

/* ADC Prescaler select bit group configurations*/
typedef enum ADC_PRESC_enum
{
    ADC_PRESC_DIV2_gc              = (ADC_PRESC_DIV2_gv << ADC_PRESC_gp),  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV3_gc              = (ADC_PRESC_DIV3_gv << ADC_PRESC_gp),  /* CLK_PER divided by 3 */
    ADC_PRESC_DIV4_gc              = (ADC_PRESC_DIV4_gv << ADC_PRESC_gp),  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV5_gc              = (ADC_PRESC_DIV5_gv << ADC_PRESC_gp),  /* CLK_PER divided by 5 */
    ADC_PRESC_DIV6_gc              = (ADC_PRESC_DIV6_gv << ADC_PRESC_gp),  /* CLK_PER divided by 6 */
    ADC_PRESC_DIV7_gc              = (ADC_PRESC_DIV7_gv << ADC_PRESC_gp),  /* CLK_PER divided by 7 */
    ADC_PRESC_DIV8_gc              = (ADC_PRESC_DIV8_gv << ADC_PRESC_gp),  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV9_gc              = (ADC_PRESC_DIV9_gv << ADC_PRESC_gp),  /* CLK_PER divided by 9 */
    ADC_PRESC_DIV10_gc             = (ADC_PRESC_DIV10_gv << ADC_PRESC_gp),  /* CLK_PER divided by 10 */
    ADC_PRESC_DIV11_gc             = (ADC_PRESC_DIV11_gv << ADC_PRESC_gp),  /* CLK_PER divided by 11 */
    ADC_PRESC_DIV12_gc             = (ADC_PRESC_DIV12_gv << ADC_PRESC_gp),  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV13_gc             = (ADC_PRESC_DIV13_gv << ADC_PRESC_gp),  /* CLK_PER divided by 13 */
    ADC_PRESC_DIV14_gc             = (ADC_PRESC_DIV14_gv << ADC_PRESC_gp),  /* CLK_PER divided by 14 */
    ADC_PRESC_DIV15_gc             = (ADC_PRESC_DIV15_gv << ADC_PRESC_gp),  /* CLK_PER divided by 15 */
    ADC_PRESC_DIV16_gc             = (ADC_PRESC_DIV16_gv << ADC_PRESC_gp),  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV17_gc             = (ADC_PRESC_DIV17_gv << ADC_PRESC_gp),  /* CLK_PER divided by 17 */
    ADC_PRESC_DIV18_gc             = (ADC_PRESC_DIV18_gv << ADC_PRESC_gp),  /* CLK_PER divided by 18 */
    ADC_PRESC_DIV19_gc             = (ADC_PRESC_DIV19_gv << ADC_PRESC_gp),  /* CLK_PER divided by 19 */
    ADC_PRESC_DIV20_gc             = (ADC_PRESC_DIV20_gv << ADC_PRESC_gp),  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV21_gc             = (ADC_PRESC_DIV21_gv << ADC_PRESC_gp),  /* CLK_PER divided by 21 */
    ADC_PRESC_DIV22_gc             = (ADC_PRESC_DIV22_gv << ADC_PRESC_gp),  /* CLK_PER divided by 22 */
    ADC_PRESC_DIV23_gc             = (ADC_PRESC_DIV23_gv << ADC_PRESC_gp),  /* CLK_PER divided by 23 */
    ADC_PRESC_DIV24_gc             = (ADC_PRESC_DIV24_gv << ADC_PRESC_gp),  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV25_gc             = (ADC_PRESC_DIV25_gv << ADC_PRESC_gp),  /* CLK_PER divided by 25 */
    ADC_PRESC_DIV26_gc             = (ADC_PRESC_DIV26_gv << ADC_PRESC_gp),  /* CLK_PER divided by 26 */
    ADC_PRESC_DIV27_gc             = (ADC_PRESC_DIV27_gv << ADC_PRESC_gp),  /* CLK_PER divided by 27 */
    ADC_PRESC_DIV28_gc             = (ADC_PRESC_DIV28_gv << ADC_PRESC_gp),  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV29_gc             = (ADC_PRESC_DIV29_gv << ADC_PRESC_gp),  /* CLK_PER divided by 29 */
    ADC_PRESC_DIV30_gc             = (ADC_PRESC_DIV30_gv << ADC_PRESC_gp),  /* CLK_PER divided by 30 */
    ADC_PRESC_DIV31_gc             = (ADC_PRESC_DIV31_gv << ADC_PRESC_gp),  /* CLK_PER divided by 31 */
    ADC_PRESC_DIV32_gc             = (ADC_PRESC_DIV32_gv << ADC_PRESC_gp)   /* CLK_PER divided by 32 */
} ADC_PRESC_t;

/* Reference Selection bit group values */
typedef enum ADC_REFSEL_VALUES_enum
{
    ADC_REFSEL_VDD_gv              = 0x00,  /* VDD */
    ADC_REFSEL_EXTVREF_gv          = 0x02,  /* External reference from EXTVREF0 pin */
    ADC_REFSEL_0V512_gv            = 0x03,  /* Internal reference 0.512 V */
    ADC_REFSEL_1V024_gv            = 0x04,  /* Internal reference 1.024 V */
    ADC_REFSEL_2V048_gv            = 0x05,  /* Internal reference 2.048 V */
    ADC_REFSEL_4V096_gv            = 0x06,  /* Internal reference 4.096 V */
    ADC_REFSEL_2V500_gv            = 0x07   /* Internal reference 2.500 V */
} ADC_REFSEL_values_t;

